Tekla.Structures.ModelInternal.SharingLocationsInformation
Implements Tekla.Structures.Model.ISharingLocationsInformation.

Tekla.Structures.ModelInternal.SharingLocationsInformation.#ctor(System.Collections.Generic.List{Tekla.Structures.ModelInternal.SharingLocation},System.Guid)
Initializes a new instance of the Tekla.Structures.ModelInternal.SharingLocationsInformation class.
locations: The sharing locations.
defaultLocation: The default location GUID.

Tekla.Structures.ModelInternal.SharingLocationsInformation.Locations


Tekla.Structures.ModelInternal.SharingLocationsInformation.DefaultLocation
